Unique=[
    {"이름":"검은수염","루피":3,"조로":0,"나미":1,"우솝":2,"상디":0,"쵸파":3,"칼병":3,"총병":3,"버기":0},
    {"이름":"도플라밍고","루피":1,"조로":1,"나미":1,"우솝":0,"상디":2,"쵸파":2,"칼병":3,"총병":0,"버기":3},
    {"이름":"로우","루피":3,"조로":1,"나미":1,"우솝":2,"상디":1,"쵸파":3,"칼병":1,"총병":1,"버기":2},
    {"이름":"루치","루피":1,"조로":0,"나미":3,"우솝":0,"상디":3,"쵸파":2,"칼병":4,"총병":2,"버기":0},
    {"이름":"루피기어서드","루피":4,"조로":1,"나미":2,"우솝":2,"상디":3,"쵸파":1,"칼병":0,"총병":0,"버기":0},
    {"이름":"류마","루피":0,"조로":5,"나미":1,"우솝":2,"상디":1,"쵸파":2,"칼병":1,"총병":0,"버기":1},
    {"이름":"마르코","루피":1,"조로":1,"나미":0,"우솝":0,"상디":2,"쵸파":3,"칼병":3,"총병":5,"버기":0},
    {"이름":"마젤란","루피":3,"조로":0,"나미":0,"우솝":1,"상디":0,"쵸파":0,"칼병":2,"총병":3,"버기":4},
    {"이름":"모몬가","루피":1,"조로":2,"나미":1,"우솝":0,"상디":2,"쵸파":1,"칼병":3,"총병":2,"버기":1},
    {"이름":"미호크","루피":0,"조로":4,"나미":1,"우솝":0,"상디":0,"쵸파":1,"칼병":4,"총병":2,"버기":0},
    {"이름":"바르톨로메오","루피":3,"조로":2,"나미":3,            "우솝":2,"상디":0,"쵸파":0,            "칼병":1,"총병":3,"버기":0},
    {"이름":"바제스","루피":1,"조로":0,"나미":1,            "우솝":1,"상디":1,"쵸파":0,            "칼병":0,"총병":5,"버기":4},
    {"이름":"바질호킨스","루피":1,"조로":1,"나미":1,            "우솝":1,"상디":0,"쵸파":2,            "칼병":2,"총병":4,"버기":3},
    {"이름":"반더덱켄","루피":2,"조로":2,"나미":2,            "우솝":0,"상디":1,"쵸파":1,            "칼병":2,"총병":3,"버기":1},
    {"이름":"벤베크만","루피":1,"조로":0,"나미":1,            "우솝":6,"상디":2,"쵸파":1,            "칼병":1,"총병":1,"버기":0},
    {"이름":"브룩","루피":1,"조로":3,"나미":1,            "우솝":0,"상디":2,"쵸파":3,            "칼병":2,"총병":0,"버기":0},
    {"이름":"비비","루피":1,"조로":0,"나미":3,            "우솝":3,"상디":0,"쵸파":1,            "칼병":2,"총병":2,"버기":1},
    {"이름":"사보","루피":3,"조로":3,"나미":0,            "우솝":1,"상디":3,"쵸파":1,            "칼병":0,"총병":3,"버기":0},
    {"이름":"상디","루피":1,"조로":1,"나미":1,            "우솝":0,"상디":4,"쵸파":3,            "칼병":1,"총병":0,"버기":2},
    {"이름":"센토마루","루피":2,"조로":1,"나미":1,            "우솝":1,"상디":1,"쵸파":3,            "칼병":2,"총병":1,"버기":2},
    {"이름":"샹크스","루피":3,"조로":0,"나미":0,            "우솝":4,"상디":0,"쵸파":0,            "칼병":0,"총병":0,"버기":3},
    {"이름":"슈가","루피":0,"조로":3,"나미":2,            "우솝":1,"상디":1,"쵸파":2,            "칼병":0,"총병":0,"버기":2},
    {"이름":"스모커","루피":3,"조로":0,"나미":1,            "우솝":0,"상디":1,"쵸파":1,            "칼병":4,"총병":2,"버기":0},
    {"이름":"시류","루피":0,"조로":0,"나미":0,            "우솝":0,"상디":3,"쵸파":1,            "칼병":5,"총병":2,"버기":1},
    {"이름":"아오키지","루피":2,"조로":0,"나미":3,            "우솝":3,"상디":3,"쵸파":4,            "칼병":0,"총병":0,"버기":0},
    {"이름":"아카이누","루피":3,"조로":2,"나미":0,            "우솝":4,"상디":2,"쵸파":0,            "칼병":0,"총병":2,"버기":1},
    {"이름":"에넬","루피":1,"조로":0,"나미":0,            "우솝":6,"상디":4,"쵸파":1,            "칼병":0,"총병":0,"버기":0},
    {"이름":"오즈","루피":3,"조로":4,"나미":0,            "우솝":0,"상디":2,"쵸파":4,            "칼병":0,"총병":0,"버기":0},
    {"이름":"우솝임팩트","루피":0,"조로":0,"나미":3,            "우솝":4,"상디":0,"쵸파":0,            "칼병":2,"총병":1,"버기":1},
    {"이름":"이완코브","루피":1,"조로":2,"나미":2,            "우솝":3,"상디":4,"쵸파":1,            "칼병":0,"총병":0,"버기":1},
    {"이름":"제프","루피":0,"조로":3,"나미":3,            "우솝":1,"상디":4,"쵸파":0,            "칼병":0,"총병":2,"버기":1},
    {"이름":"조로","루피":0,"조로":5,"나미":1,            "우솝":0,"상디":2,"쵸파":2,            "칼병":1,"총병":1,"버기":0},
    {"이름":"죠즈","루피":1,"조로":1,"나미":2,            "우솝":1,"상디":0,"쵸파":2,            "칼병":3,"총병":2,"버기":1},
    {"이름":"쵸파가드포인트","루피":1,"조로":3,"나미":0,            "우솝":0,"상디":2,"쵸파":4,            "칼병":2,"총병":1,"버기":1},
    {"이름":"크로커다일","루피":2,"조로":1,"나미":2,            "우솝":3,"상디":2,"쵸파":0,            "칼병":2,"총병":1,"버기":2},
    {"이름":"키드","루피":1,"조로":1,"나미":4,            "우솝":0,"상디":0,"쵸파":2,            "칼병":1,"총병":1,"버기":3},
    {"이름":"키자루","루피":3,"조로":1,"나미":1,            "우솝":2,"상디":1,"쵸파":3,            "칼병":1,"총병":1,"버기":2},
    {"이름":"킨에몬","루피":2,"조로":1,"나미":1,            "우솝":1,"상디":0,"쵸파":1,            "칼병":2,"총병":4,"버기":1},
    {"이름":"페로나","루피":0,"조로":0,"나미":2,            "우솝":0,"상디":4,"쵸파":2,            "칼병":0,"총병":0,"버기":2},
    {"이름":"프랑키","루피":5,"조로":2,"나미":1,            "우솝":3,"상디":1,"쵸파":1,            "칼병":2,"총병":0,"버기":0},
    {"이름":"핸콕","루피":4,"조로":0,"나미":5,            "우솝":0,"상디":0,"쵸파":0,            "칼병":0,"총병":2,"버기":0}]
class Round:
    루피 = 0
    조로 = 0
    나미 = 0
    우솝 = 0
    상디 = 0
    쵸파 = 0
    칼병 = 0
    총병 = 0
    버기 = 0
    부족한수 = 0
    def found(self):
        for i in Unique:
            self.부족한수=0
            if i["루피"] - self.루피>0:
                self.부족한수 +=(i["루피"] - self.루피)
            if i["조로"] - self.조로>0:
                self.부족한수 +=(i["조로"] - self.조로)
            if i["나미"] - self.나미>0:
                self.부족한수 +=(i["나미"] - self.나미)
            if i["우솝"] - self.우솝>0:
                self.부족한수 += (i["우솝"] - self.우솝)
            if i["상디"] - self.상디>0:
                self.부족한수 += (i["상디"] - self.상디)
            if i["쵸파"] - self.쵸파>0:
                self.부족한수 += (i["쵸파"] - self.쵸파)
            if i["칼병"] - self.칼병>0:
                self.부족한수 += (i["칼병"] - self.칼병)
            if i["총병"] - self.총병>0:
                self.부족한수 += (i["총병"] - self.총병)
            if i["버기"] - self.버기>0:
                self.부족한수 += (i["버기"] - self.버기)

            if self.부족한수 < 4 :
                print("{0}:{1:.2f}".format(i["이름"],100-100*self.부족한수/(i["루피"]+i["조로"]+i["나미"]+i["우솝"]+i["상디"]+i["쵸파"]+i["칼병"]+i["총병"]+i["버기"])))
                print("부족한 갯수:")
                print("{0}: 루피:{1}, 조로:{2}, 나미:{3}, 우솝:{4}, 상디:{5}, 쵸파:{6}, 칼병:{7},총병:{8},버기:{9}".format(i["이름"],i["루피"]-self.루피,i["조로"]-self.조로,i["나미"]-self.나미,i["우솝"]-self.우솝,i["상디"]-self.상디,i["쵸파"]-self.쵸파,i["칼병"]-self.칼병,i["총병"]-self.총병,i["버기"]-self.버기))


while True:
    print(" ")
    A = Round()
    A.루피 = int(input("루피:"))
    A.조로 = int(input("조로:"))
    A.나미 = int(input("나미:"))
    A.우솝 = int(input("우솝:"))
    A.쵸파 = int(input("쵸파:"))
    A.칼병 = int(input("칼병:"))
    A.종병 = int(input("총병:"))
    A.버기 = int(input("버기:"))
    A.found()
